; domain
; Simple hallway domain for DNNs project

(define (domain simple_domain)

(:requirements :typing)

(:types
    location
)

(:predicates
    (at ?l - location ) ; agent is at location l
    (left ?l1 - location ?l2 - location) ; l1 is left of l2
    (right ?l1 - location ?l2 - location) ; l1 is right of l2
    (above ?l1 - location ?l2 - location) ; l1 is above l2
    (below ?l1 - location ?l2 - location) ; l1 is below l2
)

(:action move_left
    :parameters (?l1 - location ?l2 - location)
    :precondition (and (at ?l1) (left ?l2 ?l1))
    :effect (and (not (at ?l1)) (at ?l2))
)

(:action move_right
    :parameters (?l1 - location ?l2 - location)
    :precondition (and (at ?l1) (right ?l2 ?l1))
    :effect (and (not (at ?l1)) (at ?l2))
)

(:action move_up
    :parameters (?l1 - location ?l2 - location)
    :precondition (and (at ?l1) (above ?l2 ?l1))
    :effect (and (not (at ?l1)) (at ?l2))
)

(:action move_down
    :parameters (?l1 - location  ?l2 - location)
    :precondition (and (at ?l1) (below ?l2 ?l1))
    :effect (and (not (at ?l1)) (at ?l2))
)

)

; problem
(define (problem simple_problem) (:domain simple_domain)
(:objects 
    a - location
    b - location
    c - location
    d - location
    e - location
    f - location
    g - location
    h - location
    i - location
    j - location
)

(:init
    (at a)
    (not (at b))
    (not (at c))
    (not (at d))
    (not (at e))
    (not (at f))
    (not (at g))
    (not (at h))
    (not (at i))
    (not (at j))

    (below b a)
    (above a b)

    (below c b)
    (above b c)

    (right d c)
    (left c d)

    (right e d)
    (left d e)

    (right f e)
    (left e f)

    (right g f)
    (left f g)

    (right h g)
    (left g h)

    (below i h)
    (above h i)

    (below j i)
    (above i j)

)

(:goal (and
    (at j)
    (not (at a))
    (not (at b))
    (not (at c))
    (not (at d))
    (not (at e))
    (not (at f))
    (not (at g))
    (not (at h))
    (not (at i))
))

)

; plan
1. (move_down a b)
   deleted: (at a)
   added: (at b)
   goals met: 8 of 10
2. (move_down b c)
   deleted: (at b)
   added: (at c)
   goals met: 8 of 10
3. (move_right c d)
   deleted: (at c)
   added: (at d)
   goals met: 8 of 10
4. (move_right d e)
   deleted: (at d)
   added: (at e)
   goals met: 8 of 10
5. (move_right e f)
   deleted: (at e)
   added: (at f)
   goals met: 8 of 10
6. (move_right f g)
   deleted: (at f)
   added: (at g)
   goals met: 8 of 10
7. (move_right g h)
   deleted: (at g)
   added: (at h)
   goals met: 8 of 10
8. (move_down h i)
   deleted: (at h)
   added: (at i)
   goals met: 8 of 10
9. (move_down i j)
   deleted: (at i)
   added: (at j)
   goals met: 10 of 10
